
## :white_check_mark: Apply Succeeded (dev)

[CI link](https://github.com/a-company-jp/digi-baton/actions/runs/13704917539)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
azurerm_resource_group.state-demo-secure: Refreshing state... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/state-demo]
azurerm_resource_group.digi_baton: Refreshing state... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton]
azurerm_container_registry.frontend: Refreshing state... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonFrontendDev]
azurerm_container_registry.external: Refreshing state... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonExternalDev]
azurerm_container_registry.backend: Refreshing state... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonBackendDev]
azurerm_container_registry.crypto: Refreshing state... [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.ContainerRegistry/registries/DigiBatonCryptoDev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_storage_account.main will be created
  + resource "azurerm_storage_account" "main" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + enable_https_traffic_only          = (known after apply)
      + https_traffic_only_enabled         = (known after apply)
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "japaneast"
      + min_tls_version                    = "TLS1_2"
      + name                               = "digibatonmainstorageacct"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "digi-baton"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"

      + blob_properties (known after apply)

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # azurerm_storage_container.public_container will be created
  + resource "azurerm_storage_container" "public_container" {
      + container_access_type             = "blob"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "digibatonpublic"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "digibatonmainstorageacct"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
azurerm_storage_account.main: Creating...
azurerm_storage_account.main: Still creating... [10s elapsed]
azurerm_storage_account.main: Still creating... [20s elapsed]
azurerm_storage_account.main: Still creating... [30s elapsed]
azurerm_storage_account.main: Still creating... [40s elapsed]
azurerm_storage_account.main: Still creating... [50s elapsed]
azurerm_storage_account.main: Still creating... [1m0s elapsed]
azurerm_storage_account.main: Still creating... [1m10s elapsed]
azurerm_storage_account.main: Creation complete after 1m16s [id=/subscriptions/079243f8-647d-4602-908a-7f755b3dfbcf/resourceGroups/digi-baton/providers/Microsoft.Storage/storageAccounts/digibatonmainstorageacct]
azurerm_storage_container.public_container: Creating...
azurerm_storage_container.public_container: Creation complete after 2s [id=https://digibatonmainstorageacct.blob.core.windows.net/digibatonpublic]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"run-terraform-apply","PRNumber":30,"Program":"tfcmt","SHA1":"ad0180ddaa52eaa3a748b832a2cea27bdc3fe1ea","Target":"dev","Vars":{},"WorkflowName":"[Infra] Run Terragrunt Apply on main branch push"} -->